[
	{
		"id": "status-page",
		"title": "Structured, merchant-friendly status page",
		"description": "Designed and implemented a new merchant-facing status page, translating internal incident data into clear, scan-friendly language and categories.",
		"tags": ["Comms", "Systems", "Merchant UX"],
		"cover": "images/status-page-2.png",
		"images": ["images/status-page-2.png", "images/status-page-3.png"],
		"summary": "Created a merchant-facing status page that surfaces incidents in plain language and clear categories, staying in sync with engineering data.",
		"context": "Before, incident comms used internal SEV codes and technical terms, so merchants couldn’t quickly gauge impact. We needed a page that spoke the merchant’s language while mapping to our internal systems.",
		"role": "Led content strategy: defined service groupings, status keys, and message patterns; partnered with Engineering and Incident Response to connect live data to external language.",
		"approach": [
			"Defined incident taxonomy and merchant-friendly service groupings",
			"Designed a tiered incident model + reusable update templates (status page, email, in-product)",
			"Aligned internal data fields to external copy with Engineering/IR"
		],
		"impact": [
			"Reduced uncertainty during incidents via real-time, plain-language updates",
			"Consistent incident language across channels",
			"Scalable taxonomy mapped to internal services"
		]
	},
	{
		"id": "webhook-troubleshooting",
		"title": "Webhook troubleshooting self-service",
		"description": "Redesigned webhook troubleshooting to connect scheduled + manual retries, clarify errors, and streamline resolution.",
		"tags": ["Developer UX", "Reliability"],
		"cover": "images/webhooks-troubleshoot-4.png",
		"images": [
			"images/webhooks-troubleshoot-4.png",
			"mages/webhooks-troubleshoot-2.png"
		],
		"summary": "Connected scheduled and manual retries, clarified errors and states, and made failures diagnosable without support.",
		"context": "Developers struggled to diagnose webhook failures and escalated to Solutions Engineers. Retry logic across automated and manual paths was unclear.",
		"role": "Owned content design: terminology, sequencing, and QA-ready specs; facilitated alignment across PM, Engineering, and Support.",
		"approach": [
			"Connected scheduled + manual retries within the UI",
			"Raised the quality bar for error/state messaging",
			"Standardised terms and information hierarchy; shipped QA-ready spec"
		],
		"impact": [
			"4.5/5 design clarity; 4.1/5 usefulness",
			"70%+ self-service rate for troubleshooting",
			"~2 hrs/week SE time saved; strong merchant feedback"
		]
	},
	{
		"id": "ia-onboarding",
		"title": "Clear onboarding for a redesigned information architecture",
		"description": "Onboarded users to a major navigation restructure with task-focused coach marks and governance for future changes.",
		"tags": ["Navigation", "Onboarding", "Merchant UX"],
		"cover": "images/ia-onboarding-2.png",
		"images": [
			"images/ia-onboarding-2.png",
			"images/ia-onboarding-3.png",
			"images/ia-onboarding-4.png",
			"images/ia-onboarding-5.png"
		],
		"summary": "Introduced coach marks and navigation cues to help merchants adapt quickly to a new IA while avoiding support spikes.",
		"context": "A large navigation restructure risked confusion and increased support tickets if not communicated in-product.",
		"role": "Led content decisions through critiques and sign-off under tight timelines; mapped old→new IA and set governance for future changes.",
		"approach": [
			"Directed messaging end-to-end; final content calls in critiques",
			"Used coach marks + in-context cues for high-visibility changes",
			"Mapped old→new IA relationships; set governance rules"
		],
		"impact": [
			"Ease-of-access rated 5/5 post-launch",
			"Navigation-related support spikes avoided",
			"Governance model established for future IA updates"
		]
	},
	{
		"id": "tooltip-standards",
		"title": "Tooltip & popover standards",
		"description": "Directive rules for tooltips and popovers, embedded in the design system with accessible examples and limits.",
		"tags": ["Systems", "Accessibility"],
		"cover": "images/tooltips-1.png",
		"images": ["images/tooltips-1.png", "images/tooltips-2.png"],
		"summary": "Turned fuzzy guidance into directive standards with accessibility baked in, reducing misuse and review cycles.",
		"context": "Tooltips and popovers were inconsistently used, causing usability issues and extra review cycles.",
		"role": "Defined principles and rules; integrated guidance into the design system; partnered with design/engineering for adoption.",
		"approach": [
			"Set core principle: tooltips are supplemental, not essential",
			"Clarified tooltip vs popover vs inline text; set max lengths",
			"Added explicit labels and colour-blind-friendly indicators; linked DS components"
		],
		"impact": [
			"Reduced ambiguity and misuse across product",
			"Improved accessibility",
			"Faster, fewer review cycles"
		]
	}
]
